<template>
  <section class="myclass hero is-info is-fullheight">
            <div class="hero-body">
                <div class="container has-text-centered">
                  <div>
                    <flip-countdown deadline="2018-11-1 00:00:00"></flip-countdown>
                  </div>
                    <div class="column is-6 is-offset-3">
                        <div v-anime="{ rotate: '1turn', backgroundColor: '#FFF', duration: 20000, loop: false }">
                          <h1 class="title">
                            Happy Birthday
                          </h1>
                        </div>
                    </div>
                    <div class="recap-container">
                      <div class="recap">
                        <a
                          class="button is-primary is-rounded"
                          @click="isComponentModalActive = true"
                            >
                            สิ่งที่ผมรู้จักคุณ
                        </a>
                        <b-modal :active.sync="isComponentModalActive" has-modal-card>
                            <!-- <modal-form v-bind="teamname"> -->
                              <div class="modal-background"></div>
                              <div class="modal-card">
                                <header class="modal-card-head">
                                  <p class="modal-card-title">Recapture I.N.G.F.A.H</p>
                                  <button class="delete" aria-label="close" @click="onCancel"></button>
                                </header>
                                <section class="modal-card-body">
                                  <p class="content">
                                      <ul className="recap-des">
                                        <li>กินผงชูรส ไม่ได้ เจ็บคอกินผงชูรส ไม่ได้ เจ็บคอ</li>
                                        <li>ชอบเหนื่อยย (ผมจะพยายามช่วยนะ)</li>
                                        <li>ร้อนง่ายเหลือเกิน >> เอาหมอนข้างระบายความร้อน</li>
                                        <li>โหมดดวงจันทร์ตอนนอน ดวงจันทร์กลางวัน บางวัน ก็มี</li>
                                        <li>ปล่อยวางไม่เป็น เลยยยยยยยย</li>
                                        <li>ชอบ "เรอะ" แบบ สุพรรณ  แต่ก็ติด คำว่า "นิ" คนที่ไหนว่ะ</li>
                                        <li>ไม่กินผักอิงไม่กินผัก</li>
                                      </ul>
                                  </p>
                                </section>
                                <footer class="modal-card-foot">
                                  <button class="button" @click="onCancel">Exit</button>
                                </footer>
                              </div>
                            <!-- </modal-form> -->
                        </b-modal>
                      </div>
                      <div class="recap">
                        <a
                          class="button is-info is-rounded"
                          @click="isComponentModalActive2 = true"
                            >
                            ✍️บันทึกของผม
                        </a>
                        <b-modal :active.sync="isComponentModalActive2" has-modal-card>
                            <!-- <modal-form v-bind="teamname"> -->
                              <div class="modal-background"></div>
                              <div class="modal-card">
                                <header class="modal-card-head">
                                  <p class="modal-card-title2">Once upon a time, meeting someone who makes you happy</p>
                                  <button class="delete" aria-label="close" @click="onCancel"></button>
                                </header>
                                <section class="modal-card-body">
                                   <article class="message is-primary">
                                    <div class="message-header">
                                      <p> 📚 📖Dairy ทำไมจึงเริ่มเขียน ?</p>
                                      <button class="delete" aria-label="delete"></button>
                                    </div>
                                    <div class="message-body2">
                                      หลังจากจบค่าย pizza🍕 hackathon ไป ผมก็ได้มาคุยกับเทอต่อในวันนี้ (Monday) วันนี้เทอไม่ไปเรียนช่วงเช้านะ เพราะ เทอต้องไปทำ passport ที่ จะไป travel ในวันเกิดของเทอกับพี่สาวส่วนผมก็ตื่น ทำกิจจกรรมเสร็จ ลงไปกินข้าว แล้วก็คุยกับเทอ แต่มีเรื่องหนึ่งที่เทอเหมือนไม่เชื่อ ตัวเอง ก็คือ ส่วนสูงนะ เทอบอกว่าวัด มาตลอด คือ 165 แต่พอมาวัดที่นี้ เทอสูง 161 เทอก็โทรมาเมาส์มอย ว่าเฮ่ยเพิ่งรู้อ่ะ แกรร ฉันวัดมา 165 ตลอดนะ 555 ผมว่าเทอเข้าใจผิดมาตลอดแหละ แถมเทอยังบอกว่า พี่พนักงานเขาบอกส่วนสูงไม่มีวันลดดด้วย  แล้วเทอก็ไปกินข้าวหมกไก่กับพี่สาว แล้วก็บ่นว่าเจ็บคอแน่เลย แต่กิน ยณะกินก็บ่นว่าอยากกินโกโก้ตลอดแต่ก็ไม่ได้ซื้อเพราะเทอจะไปซื่อน้ำผลไม้ที่ม (น้ำผลไม้มันมีอะไรดี) จากนั้น ผมก็ไปห้องสมุด วันนี้ดูเหมือน alert เป็นพิเศษ ผมว่าน่าจะเป็นเพราะ น้ำ เพื่อสุขภาพ(ผสมกัญชาแน่ๆ) เทอดูสดใสที่สุดตั้งแต่ที่ผมคุยกับเทอมา เทอบอกให้ผมเตือน เรื่อง จ่ายค่าเทอมแล้ว ก็ เติมบัตรเกมส์ เฮ้ยย MRT  5555 (ถามว่าผมเตือนเทอเหรอ เปล่า 555 ผมลืมม)
                                      พอเลิกเรีนยน เทอก็จะไปรอรถตู้ด้วยความที่วันนั้น ฝนตก☔️  เทอเลยรอรถนาน เทอบ่นว่าหิว วดฟ ผมก็เลยไปกินไอตืม แล้วก็ถ่ายให้เทอดูเป็นรางวัลความอดทนน 555 สัส เลวววว หลังจากนั้นเทอก็ถึงหอแล้วก็กินลูกชิ้น แล้วเทอก็เจ็บคอตามสูตรเดิมแล้วเทอก็ซักผ้า พอตากผ้าก็ทะเลาะกับพี่สาว 5555 บรรยากาสเรื่มมาคุ  แล้วจากที่เทอ alert ก็ เปลี่ยนไป ผมคุยกับเทอจนถึงก่อนนอน แล้วเทอก็บอกผมว่า อยาก กลับไปออนเฟส ผมก็ลืมไปว่าเทอพูดเรื่องนี้เมื่อตอนไหนอันนี้ผมผิดเอง ผมจำอะไรไม่ค่อยได้ จึงเป็นเหตุผลที่ทำให้ผมต้องเริ่มมาเขียน Diary ครับ คืนนี้จบไม่สวยเท่าไหร่                                    </div>
                                  </article>
                                   <article class="message is-link">
                                    <div class="message-header">
                                      <p>วันธรรมดา ก็ประมาณ นี้แหละ😮 </p>
                                      <button class="delete" aria-label="delete"></button>
                                    </div>
                                    <div class="message-body2">
                                    วันนี้ผมตื่นเช้าแล้วก็โทรไปหาอิงค์แต่อิงค์ไม่รับ ตอนแรกผมก็คิดว่าเทอโกรธเรื่องเมื่อคืน ผมละกลัว แต่สุดท้ายเทอก็โทรกลับมา ผมละโล่งใจ วันนี้เทอกินข้าวกับอาหารที่มีส่วนผสมของหน่อไม้, ถั่วฝักยาว ,ไก่ และพริกแกงเทอบอกอาหารแปลกๆ เทอบ่นว่าหวาน แต่ก็ต้องฝึนกินแถมมีผงชูรสด้วยย หลังจากนั้น
                                    เทอก็ รีดผ้า แล้วก็ขึ้นรถไปม เทอนมกับกล้วย กินก่อนเข้า class หลังจากกนั้นเราก้ไม่ได้คุยกันอีกทีตอนเลิกเรียน เทอก็มาบอกว่าวันนี้สอบแบบงงๆ ด้วยเป็นการสอบพูด เรื่องจริยะธรรมธุรกิจ แล้วก็ผ่านมาด้วยดีมั้ง เทอบอก แล้วก็ลงมา ฟ้าฝนก็เป็นใจ เทอยืนรอแล้วรถเมย์ก็เมินเทอๆ เทอเลยเกรี้ยวกราด 555 รอจนรอไม่ไหว ต้อง MRT 555 แล้วเทอก็กลับบ้าน แล้วเราก็ได้เทอบอกว่าง่วงและมีเพื่อนทักมา ออมไง จะใครล่ะ  วันนนี้เทอกินลูกชิ้นอีกแล้ว แล้วก็ตามสูตร แล้วเทอก็เจ็บคอ แล้วเทอก็บอกว่าอยากมีลูก เพราะ เทอชอบที่ได้รักใครสักคน   👪 </div>
                                  </article>
                                   <article class="message is-info">
                                    <div class="message-header">
                                      <p>🤷🏻‍♀️เรื่องราวของเวลา(ผมเคยทำแบบนี้กับแค่บางคน)</p>
                                      <button class="delete" aria-label="delete"></button>
                                    </div>
                                    <div class="message-body2">
                                        today is a good day , อิงค์  wake up  6.36  because  me calling to her hhaha , Ing eat breakfast is ข้าวเหนียวหมูปิ้ง , today เทอ ไม่ค่อยตั้งใจเรียน เทอเล่นโทรศัพย์ตลอด(เด็กดื้อ) พอเทอเลิกเทอก็ไปหาหอกับขมพู่ ระหว่างน้น เทออยู่ในสายตลอด ผมเลยได้รู้บางมุมของเทอ ผมยอมรับนะว่าบางมุมผมไม่ค่อยชอบสักเท่าไหร่ แต่ไม่เป็นไรทุกคนมีข้อเสียแตกต่างกันไป รวมถึงผมด้วย (หล่ออ่ะแกรรรร) ผมได้ยินเทอบ่นขมพู่เรื่องกระโปรงบ่อยย มากกก แล้ว ก็ มี คำว่า Hee หลุดมา 555 ว๊ายยย ธาตุแท้สินะ normally มาก ผมว่าผมหนักกว่านะ เวลาอยู่กับเพื่อน เทอ บอกว่าเมื่อกี้ วินมอไซมอง แล้ว บอกว่า อื้อหืออออออออ 555 โรคจิตด้วย แต่ปกติของผู้ชายแหละ สุดท้ายเทอก็ได้หอส่งรูปให้ในไลน์ด้วยดีใจอ่ะ  ก่อนหน้านี้เทอโทรมาบอกด้วยย แหม่ซึ่ง แล้วเทอก็เดินทางไปยัง ตลาด นีออนที่หล่อนบอกว่าผ่านทุกวันแต่พอไปแล้วไม่มีอ่ะไร เทอบอกว่า ไม่น่ามาเลย ใช่ แบตมือถือเไม่ถึง 10 เปอ ยังจะไปอีก เดี่ยวหมดคนอื่นติดต่อไม่ได้จะแย่นะ ครับ อันนี้ผมคิดในใจไม่ได้บอกหรอก ตกเยนวันนี้เทอปากหมามากในแชท ด่าควยด่าสัสส สาระพัด แต่ผมก็ไม่เป็นไรนะ แล้ว เหตุการไม่คาดดฝันก็เกิดขี้นเมื่อผมเทอหาเทอคุยกันสักพัก เทอก็ถามว่ารู้ไหมเทอทำอะไรพรุ่งนี้ WTF ฉิบหายคือผมจำไม่ได้แล้วก็เงียบไปพักนึงแล้วก็ทำเป็นกวนตีนเพื่อลดบรรยากาศตึงเครียดแต่คราวนี้ไม่ได้ผล เทอบอกว่าผมเด็ก (แอบเสียใจนิดๆนะ>
                                        ผมอุส่ายอมเดินกลับจากสนามแบต เกือบสองโลได้มั้งเพื่อจะได้คุยกับเทอแต่มันไม่เป็นอย่างที่คิด
                                        ผมรู้สึกผิดที่จำอะไรไม่ได้ คือ มันลืมจริงๆ แล้วผมก็รวบรวมความกล้าเพื่อถามเทอว่า ช่วยงานหน่อยแล้วเทอก็บอกว่าง่วง (ใจเสียไปหมด> แต่ก็มีบอกว่ารีบส่งมาจะนอน เราก็ดีใจ มันยังไม่จบแค่นั้น ผมก็เงียบไม่กล้าพูดอะไร สุดท้ายเทอก็ส่งข้อคความมาว่า เทอไม่อยากคุยกับคนรุ่นเดียวหรือ เด็กกว่าหรอนะ แต่ เราจะเปิดโอกาศให้เทออ แล้วก็ออะไร ต่อ ยาวมาก so on  คือตอนนนสุดท้ายที่เทอบอกว่าผมน้ำตาคลอ คือเราไม่เคยทำแบบนี้กับใคร ผมกดดันนะ แต่ผมก็รู้สึกว่าเวลามันยังไม่มากพอบางอย่างผมก็ปรับตัวไม่ทัน แต่ผมก็พยายามอยู่ ผมไม่ค่อยได้ใส่ใจใครนานมากแล้ว คนสุดท้ายที่เราทำอะไรให้จริงจัง แบบนอนกอดกัน เกือบทุกคืน คือตาของผม ผมนึกถึงตา แล้วน้ำตามันก็คลอ คือเราสนิทกันมากตาเป็นคนที่ดันประคูตอนเด็กไม่ให้แม่เข้ามาตีผม ผมรู้รายละเอียดขอ ตา ผมเยอะมากและนอกจากตาก็ไม่เคยใส่ใจใครมากกกเลยยยย ด้วยความที่เราสนิทด้วยเรื่องของเวลาด้วยที่ผูกพัน ผมมมองว่าผมกับอิงเวลามันยังน้อยเกินไปตอนนี้ แล้วเทอก็รีบตัดสินผม มันยากนะ ที่จะทำใจ แต่ด้วยที่เราอยากหยุดอะไรที่ใครสักคนอ่ะ เราไม่อยากที่จะมานั่งใช้ชีวิตคนเดียวตอนทำงาน เราอยากทุ่ทเทกับงานโดยมีใครสักคนคอยอยู่ข้างๆ ถึงตอนนั้นถถ้าผมไม่มีใครผมคิดว่าผมแย่แน่ๆ ผมพยายามมากกับความรักครั้งนี้ "ปล ผมกวนตีนเทอคล้ายๆ กวนตีนตาเลย"
                                    </div>
                                  </article>
                                   <article class="message is-success">
                                    <div class="message-header">
                                      <p>🥂First meet First Impression ... แล้วเราก็หากันจนเจอ</p>
                                      <button class="delete" aria-label="delete"></button>
                                    </div>
                                    <div class="message-body2">
                                      วันนนี้ผมรู้สึกเป็นวันที่ดีมากๆ อีกวันหนึ่งของชีวิต เพื่อนมาตั้งแต่เช้า แล้วเราก็ไปห้องสมุด กัน ตบมุกกันโบะบะ แต่เหตุการที่ไม่คาดฝันก็เกิดขึ้น อิงค์ ชวนผม ไป union mall  >> so glad มากๆๆๆ ผมเลยไปที่รถตู้ให้เร็วที่สุด ด้วยเสื้อยับๆ ที่อิงบอกว่า ให้ไปรีดมานะ ควยย กุไม่รีดหรอก เป็นยังไงก็จะเป็นอย่างนั้น 5555 I' m so lazy . ผมจะลง จตุจักร แต่ เทอบอกว่าให้ลง central lad เห้อ ไอเราก็ ขก เดิน อะเนาะ ล่วงไปในปาเก๋า อ้าวไม่เจอ บัตร mrt กุเดินก็ได้ว่ะ แล้วก็ไป ยัง destination ที่ยังเขา นัดเราไว้ ผมยอมรับว่าพอถึงแล้วไม่กล้าไปเจอ คือ กุมาสภาพ แบบ ไม่พร้อม มากกกกก กลัววววววววว แต่พอเจอ ผมดีใจนะ ที่เทอไม่แคร๋ ภายนอกเลย ผมชอบบบบ เพราะ ผมก็ไม่ชอบมองใครที่วัตถุอยู่แล้ว ยอมรับว่าประทับใจเรื่องนี้ มากกจริงๆ แล้วความประหม่าก็หายไป แล้วเทอ ก็เดินพาผมไปซื้อชุดที่เทอ list ไว้ เลือกนานสัสสสส แม่ง แต่ก็รอเพราะมีความสุข 5555 ตอนแรกผมไม่กล้ามองหน้าเทอเขินมากกกก แล้วก็มากล้าสบตา เทอตอนกิน ชาบู🍜 กัน ผมชอบมองตาเทอ ดูแล้วมีความสุขขขขขขขข แล้ว เราก็เดนต่อไปทำอะไรด้วยกัน ผมชอบตอนที่ผมถอนเสี้ยนที่มือเทอ ชอบบบ ไม่ได้จับมือกับใครนานมากแล้ว
                                      อิอิ เท่านี้แหละ
                                    </div>
                                  </article>
                                </section>
                                <footer class="modal-card-foot">
                                  <button class="button" @click="onCancel">Exit</button>
                                </footer>
                              </div>
                            <!-- </modal-form> -->
                        </b-modal>
                      </div>
                    <div class="recap">
                        <a
                          class="button is-primary is-rounded"
                          @click="isComponentModalActive3 = true"
                            >
                           👣  Behide the seen
                        </a>
                        <b-modal :active.sync="isComponentModalActive3" has-modal-card>
                            <!-- <modal-form v-bind="teamname"> -->
                              <div class="modal-background"></div>
                              <div class="modal-card">
                                <header class="modal-card-head">
                                  <p class="modal-card-title">This coding is the hardest.</p>
                                  <button class="delete" aria-label="close" @click="onCancel"></button>
                                </header>
                                <section class="modal-card-body">
                                     <article class="message is-success">
                                        <div class="message-body">
                                            <p>🤑🤑🤑🤑สวัสดี อันที่จริง webมันไม่เป็นแบบนี้หรอก มันติดปัญานิดหน่อย เราเลยต้อง remake และยังเหลือ Feature เยอะอีกมากก ตอนแรกก็กะจะจำต่อให้หมด แต่มันทำต่อไม่ได้ มัน....  แต่ถ้ามีโอกาศ หรือสภาพจิตใจพร้อมกว่านี้ก็จะทำทุกอย่างให้เสร็จก่อนวันเกิดเทอล่ะกัน</p>
                                        </div>
                                      </article>
                                      <article class="message is-warning">
                                          <div class="message-header">
                                            <p>ทำไมต้องทำล่ะ? ✍🏾 ✍🏾 </p>
                                            <button class="delete" aria-label="delete"></button>
                                          </div>
                                          <div class="message-body">
                                            เราเริ่มทำมาสักพักล่ะ และไม่อยากเสียความตั้งใจ อ่ะ เราอยากจะทำสิ่งที่สามารถทำให้ให้มันเสร็จไม่อยากจะทิ้งงานกลางทาง ตั้งใจแล้วได้แค่ไหนก็ส่งแค่นั้น
                                          </div>
                                        </article>
                                        <article class="message is-info">
                                          <div class="message-header">
                                            <p>🤦‍♂️ได้อะไรบ้างไอสิ่งที่ทำ ?</p>
                                            <button class="delete" aria-label="delete"></button>
                                          </div>
                                          <div class="message-body">
                                            การทำงานภายใต้สภาวะ ความกดดัน ฝืน และเราคิดว่าถ้าเราได้ทำงานใต้สภาวะนี้อีกันคงจะผ่อนคลายลงบ้าง ถือซ่ะว่าประสบการณ์ 👩🏻‍💻coding ที่กดดันที่สุดล่ะ
                                          </div>
                                        </article>
                                        <article class="message is-danger">
                                          <div class="message-header">
                                            <p>🙏ขอบคุณสักกะนิด</p>
                                            <button class="delete" aria-label="delete"></button>
                                          </div>
                                          <div class="message-body">
                                            ขอบคุณที่เคยคุย บ่นให้ฟัง ปรึกษา ปกติ ไม่เคยทำอะไรแบบนี้ อาจจะแปลกกหน่อย ขอบคุณที่เล่าเรื่องหลายๆอย่างให้ฟัง ไร้สาระส่วนใหญ่ Amazing บ้างบางเรื่อง มองเผินๆดูไม่ออก
                                          </div>
                                        </article>
                                        <article class="message is-link">
                                          <div class="message-header">
                                            <p>โชคดีครับ🖐🏼</p>
                                            <button class="delete" aria-label="delete"></button>
                                          </div>
                                        </article>
                                </section>
                                <footer class="modal-card-foot">
                                  <button class="button" @click="onCancel">Exit</button>
                                </footer>
                              </div>
                            <!-- </modal-form> -->
                        </b-modal>
                      </div>
                     </div>
                </div>
            </div>
    </section>
</template>
<script>
import FlipCountdown from 'vue2-flip-countdown'
export default {
  name: 'home',
  components: { FlipCountdown },
  data () {
    return {
      isComponentModalActive: false,
      isComponentModalActive2: false,
      isComponentModalActive3: false
    }
  },
  mounted () {
    this.$anime(/* ... animate something ... */)
  },
  methods: {
    onCancel () {
      this.isComponentModalActive = false
      this.isComponentModalActive2 = false
      this.isComponentModalActive3 = false
    }
  }
}
</script>

<style scoped>
.myclass {
  background-image: url('../assets/ingfah.gif');
  height: 100vh;
  background-repeat: no-repeat;
  background-size: cover;
  background-position: center;

  display: flex;
  flex-direction: column;
  align-content: center;
  justify-content: center;

  text-align: center;
}
h1.title {
    font-size: 4em;
    font-family: 'Gamja Flower', cursive;
    color: chartreuse;
}
.my-box {
  margin-top: 30px !important;
}
p.modal-card-title {
  font-family: 'Gamja Flower', cursive;
}
p.modal-card-title2 {
  font-family: 'Gamja Flower', cursive;
  font-size: 15px;
  color:  black !important;
}
p.content {
  color:  black !important;
  font-size: 10px;
  font-family: 'Itim', cursive;
}
ีul.recap-des {
  flex-wrap: wrap;
  align-items: flex-start;
}
div.recap {
  margin-top: 15px;
}
.recap-container {
  display: block;
}
.message-body2 {
  font-size: 12px !important;
  color: black;
}
</style>
